# Lockable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mullion..::..Lockable Property
Mullion Class See Also
---
Get - to get whether the Mullion can be lock or unlock.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Lockable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Lockable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Lockable {
	bool get ();
}
```

# See Also
Mullion Class
Autodesk.Revit.DB Namespace